services/events/lib/scripts/stresstest/artillery5.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 20
      name: "1"
    - duration: 120
      arrivalRate: 1
      name: "2"
    - duration: 30
      arrivalRate: 20
      name: "3"
    - duration: 120
      arrivalRate: 1
      name: "4"
    - duration: 30
      arrivalRate: 20
      name: "5"
    - duration: 120
      arrivalRate: 1
      name: "6"
    - duration: 30
      arrivalRate: 20
      name: "7"
    - duration: 120
      arrivalRate: 1
      name: "8"
scenarios:
  - name: "Query New Order Events"
    flow:
      - loop:
        - get:
            url: "/api/orders?year=2017&month=11&day=8"
        count: 20