services/events/lib/scripts/stresstest/artilleryRandom.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 600
      arrivalRate: 2
      name: "Initial"
  processor: "./artilleryRandomGen.js"
scenarios:
  - name: "Query New Order Events"
    flow:
      - function: "generateRandomData"
      - loop:
        - get:
            url: "/api/orders?year={{ year }}&month={{ month }}&day={{ day }}"
        count: 60